{
    "table": [
        [
            "Context",
            "# segments",
            "Duration (sec)"
        ],
        [
            "Very aggressive barking at a stranger (L-S2)",
            "2843",
            "2778.66"
        ],
        [
            "Normal barking at a stranger (L-S1)",
            "2772",
            "2512.92"
        ],
        [
            "Barking due to assault on the owner (L-A)",
            "829",
            "956.58"
        ],
        [
            "Negative grunt (during the presence of a stranger) (GR-N)",
            "637",
            "746.6"
        ],
        [
            "Negative squeal (during the presence of a stranger) (CH-N)",
            "298",
            "546.72"
        ],
        [
            "Sadness/anxiety barking (L-TA)",
            "288",
            "200.27"
        ],
        [
            "Positive squeal (during gameplay) (CH-P)",
            "91",
            "150.49"
        ],
        [
            "Barking during play (L-P)",
            "76",
            "51.21"
        ],
        [
            "Barking due to stimulation when walking (L-PA)",
            "62",
            "84.06"
        ],
        [
            "Barking in fear at a stranger (L-S3)",
            "54",
            "45.08"
        ],
        [
            "Positive grunt (during gameplay) (GR-P)",
            "51",
            "79.56"
        ],
        [
            "Barking arrival of the owner at home (L-H)",
            "24",
            "26.2"
        ],
        [
            "Barking that is neither playful nor strange (L-O)",
            "9",
            "9.5"
        ],
        [
            "Non-dog sounds (voices, TV, cars, appliances, etc.) (S)",
            "8755",
            "14304.05"
        ],
        [
            "Total",
            "16789",
            "22491.0"
        ]
    ],
    "caption": "Table 1:  14 types of dog vocalizations together with the corresponding number of segments and duration.",
    "references": [
        "We use a dataset consisting of recordings of 74 dogs, collected in Tepic (Mexico) and Puebla (Mexico), at the homes of the dogs’ owners. A subset of this dataset was previously used by Pérez-Espinosa et al. (2018). The dog vocalizations were recorded while being exposed to different stimuli (e.g., stranger, play, see Table 1). The recordings were conducted using a video camera Sony CX405 Handycam; in this work, we only use the audio recordings, obtained using the built-in microphone on the camera. The audio codec is A52 stereo with a sampling rate of 48,000 Hz and a bit rate of 256 kbps. The protocol for obtaining the dog vocalizations used in this study was designed and validated by experts in animal behavior from the Tlaxcala Center for Behavioral Biology in Mexico.",
        "Table 1 shows the fourteen labels used in the annotation, along with the corresponding statistics for the number of segments and total duration.",
        "In this task, we predict the context of the bark; i.e., we determine the association between a dog vocalization and its surrounding. Because of the highly skewed label distribution (see Table 1), we focus on the contexts for which more examples are available: very aggressive barking at a stranger (L-S2); normal barking at a stranger (L-S1); negative squeal (in the presence of a stranger) (CH-N); negative grunt (in the presence of a stranger) (GR-N). We do not include barking due to assault on the owner (L-A) because in early experiments we found that the model cannot distinguish it from the very aggressive barking at a stranger (L-S2)."
    ]
}